In [37]:
import numpy as np
import pandas as pd

## Series

In [3]:
labels=["a","b","c"]
my_data=[10,20,30]
arr=np.array(my_data)
d={"a":10,"b":20,"c":30}

In [4]:
pd.Series(data=my_data)   #default index

0    10
1    20
2    30
dtype: int64

In [5]:
test=pd.Series(my_data,labels)   #labels passed as index  #they are in correct order so we dont need to specify
test

a    10
b    20
c    30
dtype: int64

In [6]:
test["a"]   #works as dictionary

10

In [7]:
pd.Series(arr, labels)   #works in the same way with numpy arrays as it does with lists

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)    #in case of dictionary it automatically detects the index

a    10
b    20
c    30
dtype: int64

In [9]:
ser1=pd.Series([1,2,4,6],['a','c','d','e'])

In [10]:
ser2=pd.Series([3,5,7,9],['a','x','d','e'])

In [11]:
ser1+ser2

a     4.0
c     NaN
d    11.0
e    15.0
x     NaN
dtype: float64

# Data Frames

In [8]:
 from numpy.random import randn

In [13]:
np.random.seed(101)

In [14]:
df=pd.DataFrame(randn(5,4), index=["a","b","c","d","e"],columns=["w","x","y","z"])

In [15]:
df   # index--> rows

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [32]:
type(df["w"])   #same as df.w

pandas.core.series.Series

In [38]:
df["w"]    #passed 1d array

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [39]:
type(df[["w"]])     #passing list of column names

pandas.core.frame.DataFrame

In [44]:
df[["w","z"]]      #passing list of column names

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [96]:
###   creation of new column

df["new"]=df["w"]+df["z"]

df["hii"]=df.w+df.z

df

          w         x         y         z       hii       new
a  2.706850  0.628133  0.907969  0.503826  3.210676  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303  0.874303

In [97]:
     #deletion

df.drop("w",axis=1)

df.drop(["x","w"],axis=1)

df.drop("e")    #axis need not specify as by default axis =0 and "e" is a row

df.drop("new",axis=1,inplace=True)   #use inplace if u want the "drop" to be permanent
df.drop("hii",axis=1,inplace=True)

In [98]:
df.shape #returns a tuple--> at index 0 it contains row and at 1 it contains columns

#due to this rows are refered to as 0 and columns are referred to as 1

(5, 4)

In [65]:
#in a data frame rows and columns are ultimately series

In [72]:
df.loc["a"]  #location or label based index #returns a series

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [73]:
df.loc[["a","b"]]   #passing a list of rows--> returns a Data Frame

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

In [74]:
type(df.loc[["a","b"]])

pandas.core.frame.DataFrame

In [83]:
#index based location of rows

print(df.iloc[1])   #row  -->

df.iloc[[2,3]]   #rows 2,3  --> data frame

w    0.651118
x   -0.319318
y   -0.848077
z    0.605965
Name: b, dtype: float64

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [88]:
df.loc["a","w"]   #value at a particular index

2.706849839399938

In [92]:
df.loc[["a","c"],["y","z"]]    #data frames of value of at particular indexes

          y         z
a  0.907969  0.503826
c  0.528813 -0.589001

In [19]:
booldf=df>0  #used conditional here
booldf  #this just returns the boolean value

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [20]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [24]:
# or what we can do is

df[df>0]  # we get the same result as we got earlier

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [26]:
df[df["w"]>0]    #it did not return row "c" as it ccontained value less than 0

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [29]:
df["w"]>0  #returns a true a false for each row
           # on passing the bool value , only the rows with true values will be printed

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [27]:
df[df["w"]>0]["x"]   #all in one step

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [28]:
df[df["w"]>0][["x","y"]]   #for multiple columns

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

## multiple conditionals 

**pass bitwise and ampercent and bitwise or instead of ordinary python conditionals**

In [32]:
df[ (df["w"]>0) & (df["y"]>1) ]   # "y" only satisfies the last condition(last index)

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
#setting up index

In [34]:
df["new"]="as sd fg hj kj".split()

In [36]:
df.set_index("new")

            w         x         y         z
new
as   2.706850  0.628133  0.907969  0.503826
sd   0.651118 -0.319318 -0.848077  0.605965
fg  -2.018168  0.740122  0.528813 -0.589001
hj   0.188695 -0.758872 -0.933237  0.955057
kj   0.190794  1.978757  2.605967  0.683509

In [37]:
#resetting index

In [38]:
df.reset_index()

  index         w         x         y         z new
0     a  2.706850  0.628133  0.907969  0.503826  as
1     b  0.651118 -0.319318 -0.848077  0.605965  sd
2     c -2.018168  0.740122  0.528813 -0.589001  fg
3     d  0.188695 -0.758872 -0.933237  0.955057  hj
4     e  0.190794  1.978757  2.605967  0.683509  kj

In [1]:
#multi index data frames

In [4]:
#this part is not important
outside=["g1","g1","g1","g2","g2","g2"]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))

hier_index=pd.MultiIndex.from_tuples(hier_index)

In [5]:
hier_index

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

In [6]:
#real part starts from here

In [10]:
df=pd.DataFrame(randn(6,2),index=hier_index,columns=["A","B"])

In [12]:
df  # A,B are columns

             A         B
g1 1 -0.368449  0.385499
   2  2.150753 -1.053724
   3  1.165363 -0.486419
g2 1 -0.894134  0.307747
   2  1.343055  0.275233
   3 -0.277651 -0.145124

In [13]:
df.loc["g1"]

          A         B
1 -0.368449  0.385499
2  2.150753 -1.053724
3  1.165363 -0.486419

In [15]:
df.loc["g1"].loc[1]    #using loc function

A   -0.368449
B    0.385499
Name: 1, dtype: float64

In [17]:
df.index.names   #by default object is none

FrozenList([None, None])

In [18]:
df.index.names=["Group","Num"]

In [20]:
df    #now index have names

                  A         B
Group Num
g1    1   -0.368449  0.385499
      2    2.150753 -1.053724
      3    1.165363 -0.486419
g2    1   -0.894134  0.307747
      2    1.343055  0.275233
      3   -0.277651 -0.145124

In [22]:
df.columns.names=["alpha"]

In [23]:
df

alpha             A         B
Group Num
g1    1   -0.368449  0.385499
      2    2.150753 -1.053724
      3    1.165363 -0.486419
g2    1   -0.894134  0.307747
      2    1.343055  0.275233
      3   -0.277651 -0.145124

In [26]:
#grabbing a particular value

df.loc["g2"].loc[2]  #this part grabs the index g2-> 2

df.loc["g2"].loc[2]["B"]   #final

0.2752330609875694

In [33]:
df.loc["g1"].loc[1]["B"]   #grabbing values

0.38549896340284767

In [32]:
df.iloc[0]["B"]   #alt. method

0.38549896340284767

In [35]:
#cross section method
df.xs(1,level="Num")  #grabs the value of both index 1 of level "Num"

alpha         A         B
Group
g1    -0.368449  0.385499
g2    -0.894134  0.307747

In [36]:
## Missing value

In [ ]:
[1,np.NaN,np.NaN]

In [65]:
d={"A":[1,np.NaN,3],"B":[1,2,3],"C":[1,np.NaN,np.NaN]}  #all must have same length

In [66]:
df=pd.DataFrame(d)
df

     A  B    C
0  1.0  1  1.0
1  NaN  2  NaN
2  3.0  3  NaN

In [67]:
df.dropna()   #drops all the Rows which have NaN values

     A  B    C
0  1.0  1  1.0

In [68]:
df.dropna(thresh=2)    #drops only the Rows which have 2 or more than NaN values

     A  B    C
0  1.0  1  1.0
2  3.0  3  NaN

In [69]:
#filling missing values

In [70]:
df["A"].mean()   #this calculates the mean of column A

2.0

In [71]:
df["A"].fillna(value=df["A"].mean())  #this puts the value only in NaN of column a

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [73]:
#groupby

In [75]:
data={"company":["Goog","Goog","MSFT","MSFT","FB","FB"],
      "person":["Sam","charlie","amy","vanessa","carl","sarah"],
      "sales":[200,120,340,124,243,350]}

In [77]:
df=pd.DataFrame(data)
df

  company   person  sales
0    Goog      Sam    200
1    Goog  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [83]:
obj=df.groupby("company")   #pass the column with reference to which we have to group

In [89]:
obj.mean()    #call an aggregate function on the group by object

#this is not working on person column as its in String

         sales
company
FB       296.5
Goog     160.0
MSFT     232.0

In [90]:
obj.sum()   #u can call any function u want

         sales
company
FB         593
Goog       320
MSFT       464

In [92]:
obj.sum().loc["FB"]  #since its a DataFrame

sales    593
Name: FB, dtype: int64

In [93]:
obj.min()   # min func works as python sorts string in alphabetical order

        person  sales
company
FB        carl    243
Goog       Sam    120
MSFT       amy    124

In [94]:
obj.max()

          person  sales
company
FB         sarah    350
Goog     charlie    200
MSFT     vanessa    340

In [100]:
## very important method

obj.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [103]:
obj.describe().transpose()["Goog"]   #transpose method interchanges rows and columns

sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Goog, dtype: float64

## Operations

In [4]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col1'].nunique()   #number of unique values

4

In [10]:
df['col1'].value_counts()   # column must be passed

4    1
3    1
2    1
1    1
Name: col1, dtype: int64

In [15]:
df[df['col1']>2]    
#df['col1']>2 this returns a series of bool values which passsing in the data frame 
#gives the rows with only true values

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [19]:
## apply your own function or function name

df["col1"].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df.columns  #returns a list of columns , same thing can be done with row

Index(['col1', 'col2', 'col3'], dtype='object')

In [28]:
df.sort_values("col2")   #other columns are also arranged accordingly

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
#Pivot

data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Input/Output

In [ ]:
#check out the course(Data Science and ML) notebooks